openFoamFiles/meshes/twoLiquidMixingCoarse/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  5                                     | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       volVectorField; 
    location     "0"; 
    object      U; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
Umean 0.240000; 
mUmean -0.240000; 
 
dimensions      [0 1 -1 0 0 0 0]; 
 
internalField   uniform ($mUmean  0 0); 
 
boundaryField 
{ 
    //- Set patchGroups for constraint patches 
    #includeEtc "caseDicts/setConstraintTypes" 
    outlet 
    { 
        type               zeroGradient; 
		/*         
		type            outletPhaseMeanVelocity; 
        alpha           alpha.water; 
        Umean           $Umean; 
        value           $internalField; 
		*/ 
    } 
    inlet 
    { 
        type                    fixedValue; 
        value                   $internalField; 
    } 
	barge 
	{ 
        type            movingWallVelocity; 
        value           uniform (0 0 0); 
	} 
	atmosphereFrontOfBarge 
	{ 
       type                inletOutlet;
		inletValue			$internalField; 
		value				$internalField; 
    } 
	atmosphere 
 	{
         type                    slip; 	
 	}
} 
 
// ************************************************************************* // 
