openFoamFiles/meshes/twoLiquidMixingCoarse/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;//101325;//0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        /*type            fixedFluxPressure;
        value			$internalField;*/
        type            zeroGradient;

    }

    inlet
    {
        type            fixedFluxPressure;
        value			$internalField;
    }


	barge
    {
        type            fixedFluxPressure;
        value           $internalField;

    }
    
    atmosphere
    {
        //type             waveSurfacePressure;
        //value           $internalField;
        //type            fixedValue;
        //type            totalPressure;
        //p0              $internalField;
        type            	fixedValue;
        //value           $internalField;
        //type              waveSurfacePressure;
        value               $internalField;
    }
	atmosphereFrontOfBarge
    {
        //type             waveSurfacePressure;
        //value           $internalField;
        //type            fixedValue;
        //type            totalPressure;
        //p0              $internalField;
        type            	fixedValue;
        //value           $internalField;
        //type              waveSurfacePressure;
        value               $internalField;
    }
	/*front
    {
        type            fixedFluxPressure;
        value           $internalField;
    }*/

}

// ************************************************************************* //
